Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Turning a plain data structure into an object is done by B<blessing> that data structure using Perl's C<bless> function.
es: La conversión de una estructura de datos normal en un objeto se realiza mediante la B<bendición> de la misma con la función C<bless> de Perl.

source: Two of these directories contain modules that live in the core, and two contain modules that can also be released separately on CPAN.
es: Dos de estos directorios contienen módulos integrados en el núcleo y los otros dos contienen módulos que además se publican en CPAN.

source: Typeglobs are also a way to create a local filehandle using the local() operator.
es: Los typeglobs también proporcionan una manera de crear un identificador de archivo local con el operador local().

source: Typically refers to a chunk of data that's coming from or going to a disk file.
es: Normalmente se refiere a un fragmento de datos que se lee de (o se escribe en) un archivo del disco.

source: Typically an IP address.
es: Generalmente una dirección IP.

source: Typically composed of L<literals|/literal>, L<variables|/variable>, L<operators|/operator>, L<functions|/function>, and L</subroutine> calls, not necessarily in that order.
es: Normalmente consta de L<literales|/literal>, L<variables|/variable>, L<operadores|/operador>, L<funciones|/función> y llamadas a L<subrutinas|/subrutina>, no necesariamente en ese orden.

source: Typically it would be the first declaration in a file included by the C<do>, C<require>, or C<use> operators.
es: Normalmente será la primera declaración en un archivo, incluida por medio de los operadores C<do>, C<require> o C<use>.

source: Typically refers to any of: space, tab, line feed, carriage return, or form feed.
es: Normalmente se refiere espacios, tabulaciones, avances de línea, retornos de carro o avances de página.

source: Typically you will want to C<use I<Module::Name>>, which will then give you access to exported functions or an OO interface to the module.
es: Normalmente agregará a su programa la línea C<use I<Nombre::Módulo>>, que le proporcionará acceso a las funciones exportadas o a una interfaz orientada a objetos del módulo.

source: Typically your system administrator or someone pretending to be your system administrator.
es: Normalmente, el administrador del sistema o alguien que finge ser el administrador del sistema.

source: Typically, code inside the class can treat the hash as an accessible data structure, while code outside the class should always treat the object as opaque.
es: Usualmente, el código de la clase puede tratar el hash como una estructura de datos accesible, mientras que el código externo a la clase siempre debe tratar al objeto como algo opaco.

# UNITCHECK blocks run LIFO after each file is compiled. "
source: UNITCHECK blocks run LIFO after each file is compiled.\n"
es: Los bloques UNITCHECK se ejecutan en orden LIFO tras compilar cada archivo.\n"

source: UNPACK
es: DESEMPAQUETAR

source: UTF-8 treats the first 128 codepoints, 0..127, the same as ASCII.
es: En UTF-8 los primeros 128 códigos de carácter (0 a 127) son equivalentes a ASCII.

source: Unary operators are usually prefix operators; that is, they precede their operand.
es: Los operadores unarios son generalmente operadores de prefijo; es decir, preceden al operando.

source: Uncuddled elses.
es: Instrucción C<else> en nueva línea.

source: Under C</a>, C<\d> always means precisely the digits C<"0"> to C<"9">; C<\s> means the five characters C<[ \f\n\r\t]>; C<\w> means the 63 characters C<[A-Za-z0-9_]>; and likewise, all the Posix classes such as C<[[:print:]]> match only the appropriate ASCII-range characters.
es: Con C</a>, C<\d> siempre representa exactamente a los dígitos C<"0"> a C<"9">; C<\s> representa a los cinco caracteres C<[ \f\n\r\t]>; C<\w> representa a los 63 caracteres C<[A-Za-z0-9_]>; y, del mismo modo, todas las clases Posix, como C<[[:print:]]> solo coinciden con los caracteres correspondientes de ASCII.

source: Under Perl, bolts out of the blue are called signals, and you send them with the L<kill|perlfunc/kill> built-in.
es: En Perl, los rayos que salen de la nada se llaman señales, y se envían con la función predefinida L<kill|perlfunc/kill>.

source: Under Unicode rules, there are a few case-insensitive matches that cross the 255/256 boundary.
es: Según las normas de Unicode, hay unos pocos casos de coincidencias que no distinguen mayúsculas de minúsculas y cruzan el límite 255/256.

source: Under Unix, these fake files tend to live in the I</dev> directory.
es: En Unix, estos archivos simulados se encuentran en el directorio I</dev>.

source: Under Unix, typical shells include the Bourne shell (I</bin/sh>), the C shell (I</bin/csh>), and the Korn shell (I</bin/ksh>).
es: En Unix, las shells típicas son Bourne shell (I</bin/sh>), C shell (I</bin/csh>) y Korn shell (I</bin/ksh>).

source: Under multitasking systems like Unix, two or more separate processes could be running the same program independently at the same time--in fact, the L<fork|perlfunc/fork> function is designed to bring about this happy state of affairs.
es: En sistemas multitarea como Unix, dos o más procesos independientes pueden ejecutar el mismo programa por separado simultáneamente; de hecho, la función L<fork|perlfunc/fork> está diseñada para proporcionar esta sensación de felicidad.

source: Under other operating systems, processes are sometimes called "threads", "tasks", or "jobs", often with slight nuances in meaning.
es: En otros sistemas operativos, los procesos se llaman a veces "hilos de ejecución", "tareas" o "trabajos", generalmente con ligeros matices de significado.

source: Under the hood, Perl filehandles are instances of the C<IO::Handle> or C<IO::File> class.
es: Internamente, los identificadores de archivos de Perl son instancias de las clases C<IO::Handle> o C<IO::File>.

source: Under the hood, attributes are often stored as keys in the object's underlying hash, but don't worry about this.
es: Internamente, los atributos se suelen almacenar como claves del hash subyacente del objeto, pero no debe preocuparse de estos detalles.

source: Understanding the concepts will make it much easier to read and write object-oriented code.
es: La comprensión de estos conceptos hará más fácil la lectura y escritura de código orientado a objetos.

source: Unfortunately when Perl writes to DBM databases it doesn't use NULL termination, so your Perl application will have to manage NULL termination itself.
es: Sin embargo, Perl no usa el carácter de terminación NULL al escribir en bases de datos DBM, por lo que la aplicación Perl deberá encargarse de agregar la terminación NULL.

source: Unfortunately, Perl can't keep a secret, so everyone knows about this.
es: Como Perl no se calla nada, esto es de dominio público.

source: Unfortunately, beginning programmers often confusingly employ the term "system call" to mean what happens when you call the Perl L<system|perlfunc/system> function, which actually involves many syscalls.
es: Por desgracia, los programadores principiantes suelen emplear de forma confusa el término "llamada de sistema" para referirse a lo que sucede cuando se llama a la función L<system|perlfunc/system> de Perl, que es algo que en realidad requiere realizar muchas llamadas de sistema.

source: Unfortunately, it assumes that the programmer's environment and that of the user will use the same encoding.
es: Por desgracia, este pragma supone que la codificación utilizada en el entorno del programador es la misma que la utilizada en el entorno del usuario.

source: Unicode characters.
es: caracteres Unicode.

source: Unicode has many more characters than that, so you need a method to make these accessible.
es: En Unicode hay muchos más caracteres, por lo que necesitamos una forma de hacerlos accesibles.

source: Unicode is encoded using several competing encodings, of which UTF-8 is the most used.
es: Existen varias codificaciones de Unicode en competencia, de las cuales la más utilizada es UTF-8.

source: Unless otherwise stated the ARG argument is optional; in some cases, it is forbidden.
es: A menos que se indique lo contrario, el argumento ARG es opcional; y en algunos casos está prohibido.

source: Unless noted otherwise, the size mentioned is the patch to bring version x.y.z to x.y.z+1.
es: A menos que se indique lo contrario, el tamaño mencionado es el del parche que pasa de la versión x.y.z a la x.y.z+1.

source: Unlike i, m, s and x, these two flags affect the way the regex is used rather than the regex itself.
es: A diferencia de i, m, s y x, estos dos modificadores afectan a la forma en que se utiliza la expresión regular, no a la propia expresión regular.

source: Unlike many other languages which support object orientation, Perl does not provide any special syntax for constructing an object.
es: A diferencia de otros lenguajes de programación que ofrecen orientación a objetos, Perl no dispone de una sintaxis especial para construir objetos.

source: Unlike most Unix utilities, Perl does not arbitrarily limit the size of your data--if you've got the memory, Perl can slurp in your whole file as a single string.
es: A diferencia de la mayoría de las utilidades Unix, Perl no limita de forma arbitraria el tamaño de los datos; si el sistema dispone de memoria suficiente, puede "succionar" un archivo completo como una sola cadena.

source: Unlike most locales, which are specific to a language and country pair, Unicode classifies all the characters that are letters I<somewhere> in the world as C<\w>.
es: A diferencia de la mayoría de las configuraciones regionales, que son específicas de un par idioma/país, Unicode clasifica como C<\w> todos los caracteres que son letras I<en cualquier parte> del mundo.

source: Unlike most object-oriented languages, Perl provides no special syntax or support for declaring and manipulating attributes.
es: A diferencia de la mayor parte de los lenguajes orientados a objetos, en Perl no hay una sintaxis especial ni soporte para declarar y manipular atributos.

source: Unlike some other regular expression languages, there are no backslashed symbols that aren't alphanumeric.
es: A diferencia de otros lenguajes de expresiones regulares, no se usan símbolos no alfanuméricos con caracteres de escape.

source: Unlike the mechanisms mentioned above, these affect operations besides regular expressions pattern matching, and so give more consistent results with other operators, including using C<\U>, C<\l>, etc. in substitution replacements.
es: A diferencia de los mecanismos antes mencionados, estos afectan a otras operaciones aparte de las de detección de coincidencias de expresiones regulares, por lo que ofrecen resultados más coherentes con los de otros operadores, como el uso de C<\U>, C<\l>, etc. en las sustituciones.

source: Unpack the result with
es: Desempaquete el resultado con

source: Unpack the result with C<tar -xof yourmodule.tar>
es: Desempaquete el resultado con C<tar -xof mimodulo.tar>

source: Unqualified dynamic identifiers will be in this namespace, except for those few identifiers that if unqualified, default to the main package instead of the current one as described below.
es: Los identificadores dinámicos sin calificar estarán en este espacio de nombres, excepto los pocos identificadores que, de no estar calificados, corresponderán de manera predeterminada al paquete C<main> en lugar de al actual, como se indica a continuación.

source: Unsupported in lookbehind.
es: No se admite en inspecciones hacia atrás.

source: Until that is done, those modules should be in F<cpan/>.
es: Mientras no se determine, estos módulos deben estar en F<cpan/>.

source: Until the C<(*PRUNE)> verb is reached, A may backtrack as necessary to match.
es: Hasta que se llega al verbo C<(*PRUNE)>, A puede volver atrás siempre que sea necesario para que se produzca la coincidencia.

source: Up to 3.14_05, the switch B<-v> was used to produce verbose messages of B<perldoc> operation, which is now enabled by B<-D>.
es: Hasta la versión 3.14_05 se usaba el modificador B<-v> para producir mensajes detallados del funcionamiento de B<perldoc>; ahora esta opción se habilita mediante B<-D>.

source: Updated by Kirrily "Skud" Robert, C<skud@cpan.org>
es: Actualizado por Kirrily "Skud" Robert, C<skud@cpan.org>

source: Updates for 5.8.0 by Nicholas Clark <nick@ccl4.org>
es: Actualizaciones para 5.8.0 de Nicholas Clark <nick@ccl4.org>

source: Use C<perldoc E<lt>nameE<gt>> to get information on any of the utilities described in this document.
es: Para obtener información sobre cualquiera de las utilidades descritas en este documento, use C<perldoc E<lt>nombreE<gt>>.

source: Use C<Role::Tiny> with C<Class::Accessor> or C<Object::Tiny> if you find yourself considering multiple inheritance.
es: Use C<Role::Tiny> con C<Object::Tiny> o C<Class::Accessor> si desea usar herencia múltiple.

source: Use C<local> to localize changes to them to a specific scope if necessary.
es: Si es necesario localizar cambios de las variables en un ámbito determinado, use C<local>.

source: Use Perl comments for developer notes and POD for end-user notes.
es: Use los comentarios del código Perl como notas de desarrollo y la documentación POD como notas para los usuarios finales.

source: Use \p{Prop} for longer names
es: \p{Prop} para nombres largos

source: Use a search engine to find out how to do this for your operating system.
es: Use un motor de búsqueda para averiguar la manera de hacer esto para su sistema operativo.

source: Use an index if it is present.
es: Usa un índice si existe.

source: Use braces to disambiguate, as in C<"This is ${owner}'s house">.
es: Use llaves para eliminar ambigüedades: C<"Vamos a cenar en ${Gino}'s">.

source: Use here documents instead of repeated C<print()> statements.
es: Use documentos incrustados (I<here documents>) en vez de repetir instrucciones C<print()>.

source: Use look-behind instead (see below).
es: En su lugar debe usar inspección hacia atrás (se explica más abajo).

source: Use of a single identifier, prefixed with C<*>.
es: Uso de un solo identificador con el prefijo C<*>.

source: Use the new C<and> and C<or> operators to avoid having to parenthesize list operators so much, and to reduce the incidence of punctuation operators like C<&&> and C<||>.
es: Use los nuevos operadores C<and> y C<or> para evitar poner demasiados paréntesis en listas de operadores, y para reducir la incidencia de operadores puntuación como C<&&> y C<||>.

source: Used as a noun, a name in a L</directory>, representing a L</file>.
es: El sustantivo se refiere a un nombre de un L</archivo> contenido en un L</directorio>.

source: Used by a L</standard IE<sol>O> output stream that flushes its L</buffer> after every L</newline>.
es: Se usa en una secuencia de salida de L</EE<sol>S estándar> que vuelca el L</búfer> al recibir cada L</carácter de nueva línea>.

source: Used more loosely to mean how a subroutine that is in the middle of calling another subroutine "contains" that subroutine at L</run time>.
es: En un sentido más informal, significa que una subrutina que esté en la mitad de una llamada a otra subrutina "contiene" esa subrutina en L</tiempo de ejecución>.

source: Used to describe a L</referent> that is not directly accessible through a named L</variable>.
es: Se usa para describir un L</referente> que no es directamente accesible a través de una L</variable> con nombre.

source: Used together, as C</ms>, they let the "." match any character whatsoever, while still allowing "^" and "$" to match, respectively, just after and just before newlines within the string.
es: Si se usan juntos, como C</ms>, permiten que "." detecte cualquier carácter y, a la vez, que "^" y "$" detecten, respectivamente, las posiciones justo a continuación e inmediatamente antes de los caracteres de nueva línea en la cadena.

source: Useful values for C<PERLDOC> include C<-oman>, C<-otext>, C<-otk>, C<-ortf>, C<-oxml>, and so on, depending on what modules you have on hand; or the formatter class may be specified exactly with C<-MPod::Perldoc::ToMan> or the like.
es: Algunos valores útiles para C<PERLDOC> son C<-oman>, C<-otext>, C<-otk>, C<-ortf>, C<-oxml>, etc., en función de los módulos disponibles; o bien, se puede especificar exactamente la clase de formateador con C<-MPod::Perldoc::ToMan> o similar.

source: User Datagram Protocol, the typical way to send L<datagrams|/datagram> over the Internet.
es: Protocolo de datagramas de usuario, la manera típica de enviar L<datagramas|/datagrama> a través de Internet.

source: User pragmata store their state by writing to the magical hash C<%^H>, hence these two routines manipulate it.
es: Los pragmas de usuario almacenan su estado en el hash mágico C<%^H>, por lo que se pueden usar estas dos rutinas para manipularlo.

source: User-defined subroutines may choose to care whether they are being called in a void, scalar, or list context.
es: Para las subrutinas definidas por el usuario existe la opción de considerar si la llamada se realiza en contexto vacío, escalar o de lista.

source: Users of git 1.7 or newer can do it in a more obvious manner:
es: Los usuarios de git 1.7 o posterior pueden hacerlo de una manera más obvia:

source: Users of the code should not count on implementation details staying the same unless they are part of the published L</interface>.
es: Los usuarios del código no deben contar con que se mantengan los detalles de la implementación, a menos que formen parte de la L</interfaz> publicada.

source: Using uppercase filehandles also improves readability and protects you from conflict with future reserved words.
es: El uso de identificadores de archivo en mayúsculas mejora la legibilidad de los programas y les protege de conflictos con futuras palabras reservadas.

source: Using C for input can sometimes result in security breaches, so please use C<:encoding(UTF-8)> instead.
es: El uso de C para la entrada puede permitir infracciones de seguridad en algunos casos, por lo que se recomienda usar C<:encoding(UTF-8)> en su lugar.

source: Using C<bisect.pl>, with one command (and no other files) it's easy to find out
es: Con C<bisect.pl> sólo tiene que usar un comando (y ningún otro archivo) para averiguar fácilmente lo siguiente:

source: Using C<my> in combination with a C<use strict;> at the top of your Perl scripts means that the interpreter will pick up certain common programming errors.
es: Si escribe C<use strict;> al principio de los scripts de Perl y usa C<my>, el intérprete detectará determinados errores frecuentes de programación.

source: Using C<strict> is highly recommended.
es: Es muy recomendable usar C<strict>.

source: Using the -a switch to C<branch> will also show the remote tracking branches in the repository:
es: Si usa el modificador -a con el comando C<branch>, también se mostrarán las ramas de seguimiento remoto del repositorio:

source: Usually reserved for L</lvalue> modifiers like L<my|perlfunc/my>, for L</context> modifiers like L<scalar|perlfunc/scalar>, and for the pick-your-own-quotes constructs, C<q//>, C<qq//>, C<qx//>, C<qw//>, C<qr//>, C<m//>, C<s///>, C<y///>, and C<tr///>.
es: Se suele reservar para modificadores de L</valor-izquierda> como L<my|perlfunc/my>, para modificadores de L</contexto> como L<scalar|perlfunc/scalar> y para construcciones con distintos tipos de comillas, C<q//>, C<qq//>, C<qx//>, C<qw//>, C<qr//>, C<m//>, C<s///>, C<y///> y C<tr///>.

source: Usually shortened to "executable".
es: Se suele usar la forma abreviada "ejecutable".

source: Usually this name is a single I<identifier>, that is, a string beginning with a letter or underscore, and containing letters, underscores, and digits.
es: Normalmente, este nombre es un I<identificador>, es decir, una palabra que comienza por una letra o un guión bajo, y que contiene letras, guiones bajos o dígitos.

source: Usually used for named built-in operators (such as L<print|perlfunc/print>, L<unlink|perlfunc/unlink>, and L<system|perlfunc/system>) that do not require parentheses around their L</argument> list.
es: Se suele usar en operadores predefinidos con nombre (como L<print|perlfunc/print>, L<unlink|perlfunc/unlink> y L<system|perlfunc/system>) para los que no es necesario escribir la lista de L<argumentos|/argumento> entre paréntesis.

source: Usually used in a looser sense to indicate a particular culture of programming.
es: Se suele usar también en un sentido más informal para indicar una cultura de programación específica.

source: Usually used when something that appears on the screen matches how it will eventually look, like Perl's L<format|perlfunc/format> declarations.
es: Se suele usar cuando algo que aparece en pantalla coincide con el aspecto final, como las declaraciones L<format|perlfunc/format> de Perl.

source: Usually.
es: Casi siempre.

source: VMStar xf Your-Module.tar
es: VMStar xf Mi-Modulo.tar

source: Values are usually referred to by name, or through a named reference.
es: A los valores se accede normalmente por su nombre, o a través de una referencia con nombre.

source: Variable substitution inside strings is limited to scalar variables, arrays, and array or hash slices.
es: La sustitución de variables dentro de cadenas se limita a variables escalares, arrays y porciones de array o hash

source: Variable-width fields are usually split up by L<separators|/separator> (so use L<split|perlfunc/split> to extract the fields), while fixed-width fields are usually at fixed positions (so use L<unpack|perlfunc/unpack>).
es: Los campos de ancho variable se suelen dividir mediante L<separadores|/separador> (use la función L<split|perlfunc/split> para extraer los campos), mientras que los campos de ancho fijo suelen estar en posiciones fijas (use L<unpack|perlfunc/unpack>).

source: Variables beginning with underscore used to be forced into package main, but we decided it was more useful for package writers to be able to use leading underscore to indicate private variables and method names.
es: Las variables cuyo nombre comienza con un guión bajo se solían asignar al paquete C<main>, pero en su día decidimos que para los desarrolladores de paquetes era más útil poder usar guiones bajos iniciales para indicar nombres de variables y métodos privados.

source: Varying slowly compared to something else.
es: Que varía lentamente en comparación con lo demás.

source: Versions prior to perl5.004 had serious security problems with buffer overflows, and in some cases have CERT advisories (for instance, http://www.cert.org/advisories/CA-1997-17.html ).
es: En las versiones anteriores a perl5.004 había problemas de seguridad graves con desbordamiento del búfer y, en algunos casos, notificaciones del CERT (por ejemplo, http://www.cert.org/advisories/CA-1997-17.html).

source: Views of this calendar are at L<http://www.perl.org/events.html> and L<http://www.yapc.org>.
es: Este calendario se puede ver en L<http://www.perl.org/events.html> y en L<http://www.yapc.org>.

source: Virtually all known and current Unix derivatives are supported (perl's native platform), as are other systems like VMS, DOS, OS/2, Windows, QNX, BeOS, OS X, MPE/iX and the Amiga.
es: Es compatible con prácticamente todos los sistemas operativos derivados de Unix (la plataforma nativa de perl) conocidos y actuales, así como con otros sistemas como VMS, DOS, OS/2, Windows, QNX, BeOS, OS X, MPE/iX y Amiga.

source: Visit C<http://pause.perl.org/>, select "Request PAUSE Account", and wait for your request to be approved by the PAUSE administrators.
es: Visite C<http://pause.perl.org/>, seleccione "Request PAUSE Account" (Solicitar cuenta de PAUSE) y espere a que los administradores de PAUSE aprueben su solicitud.
